---
kind: method
id: M:Autodesk.Revit.DB.PhaseArray.ReverseIterator
source: html/a7e6cbb1-b223-5d5d-02ef-17a93b6d86b0.htm
---
# Autodesk.Revit.DB.PhaseArray.ReverseIterator Method

Retrieve a backward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual PhaseArrayIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the array.